def print_last_result(last_result):
    print(f"... Последний результат: {last_result}")

def print_result(result):
    print("-" * (24 + len(str(result))))
    print(f"... Результат операции: {result}")
    print("-" * (24 + len(str(result))))

def show_commands():
    print("""
_________________
          
Возможные команды:
    1. Посчитать
    2. История
    3. Выход
_________________
          """
          )

def greeting():
    print("""
------------------------------
Калькулятор начал свою работу!
------------------------------
          """
          )

def farewell():
    print("""
------------------------------
Калькулятор завершил свою работу.
------------------------------
          """
          )
    